IRP/src/Enums/OutgoingPaymentTransactionTypes/OutgoingPaymentTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OutgoingPaymentTransactionTypes</name>
  <enumValues>
    <name>PaymentToVendor</name>
  </enumValues>
  <enumValues>
    <name>CurrencyExchange</name>
  </enumValues>
  <enumValues>
    <name>CashTransferOrder</name>
  </enumValues>
  <enumValues>
    <name>ReturnToCustomer</name>
  </enumValues>
  <enumValues>
    <name>ReturnToCustomerByPOS</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Enums/OutgoingPaymentTransactionTypes/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	StandardProcessing = False;
	ChoiceData = New ValueList();

	ChoiceData.Add(Enums.OutgoingPaymentTransactionTypes.PaymentToVendor);
	ChoiceData.Add(Enums.OutgoingPaymentTransactionTypes.ReturnToCustomer);

	If Parameters.Filter.Property("Ref") And TypeOf(Parameters.Filter.Ref) = Type("DocumentRef.BankPayment") Then
		ChoiceData.Add(Enums.OutgoingPaymentTransactionTypes.ReturnToCustomerByPOS);
	EndIf;

	If FOServer.IsUseCashTransaction() Then
		ChoiceData.Add(Enums.OutgoingPaymentTransactionTypes.CurrencyExchange);
		ChoiceData.Add(Enums.OutgoingPaymentTransactionTypes.CashTransferOrder);
	EndIf;
EndProcedure
